; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v3 ?v4)
             (pred_10 ?v7 ?v5)
             (pred_6 ?v3 ?v5)
             (pred_9 ?v8 ?v3 )
	     (pred_4 ?v3)
             (pred_1 ?v11)
             (pred_3 ?v7)
             (pred_2 ?v5)
             (pred_12 ?v3)
             (pred_5 ?v7)
             (pred_8 ?v3)
             (pred_11 ))



(:action op_1
:parameters (?v2 ?v6 ?v12 ?v10)
:precondition (and (pred_1 ?v2) (pred_1 ?v6) (pred_3 ?v12) (pred_2 ?v10)
          (pred_7 ?v2 ?v6) (pred_10 ?v12 ?v10)
                   (pred_6 ?v6 ?v10) (pred_4 ?v2) 
                   (pred_12 ?v6) (pred_5 ?v12))
:effect (and  (pred_8 ?v6) (not (pred_12 ?v6))))


(:action op_4
:parameters (?v2 ?v9)
:precondition (and (pred_1 ?v2) (pred_1 ?v9)
               (pred_4 ?v2) (pred_7 ?v2 ?v9) (pred_8 ?v9))
:effect (and (pred_4 ?v9) (not (pred_4 ?v2))))

(:action op_3
:parameters (?v2 ?v12)
:precondition (and (pred_1 ?v2) (pred_3 ?v12) 
                  (pred_4 ?v2) (pred_9 ?v12 ?v2) (pred_11 ))
:effect (and (pred_5 ?v12)
   (not (pred_9 ?v12 ?v2)) (not (pred_11 ))))


(:action op_5
:parameters (?v2 ?v1 ?v13)
:precondition (and (pred_1 ?v2) (pred_3 ?v1) (pred_3 ?v13)
                  (pred_4 ?v2) (pred_5 ?v13) (pred_9 ?v1 ?v2))
:effect (and (pred_5 ?v1) (pred_9 ?v13 ?v2)
        (not (pred_5 ?v13)) (not (pred_9 ?v1 ?v2))))

(:action op_2
:parameters (?v2 ?v12)
:precondition (and (pred_1 ?v2) (pred_3 ?v12) 
                  (pred_4 ?v2) (pred_5 ?v12))
:effect (and (pred_11 ) (pred_9 ?v12 ?v2) (not (pred_5 ?v12)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_04 obj_14 obj_09 obj_07 obj_28 obj_03 obj_18 obj_16 obj_05 obj_22 obj_02 obj_12 obj_20 obj_08 obj_25 obj_01 obj_13 obj_17 obj_19 obj_27 obj_21 obj_23 obj_06 obj_26 obj_10
    obj_24 obj_31 obj_11
    obj_30 obj_29 obj_15
    )

    (:init
       (pred_11)

       (pred_1 obj_04)
       (pred_1 obj_14)
       (pred_1 obj_09)
       (pred_1 obj_07)
       (pred_1 obj_28)
       (pred_1 obj_03)
       (pred_1 obj_18)
       (pred_1 obj_16)
       (pred_1 obj_05)
       (pred_1 obj_22)
       (pred_1 obj_02)
       (pred_1 obj_12)
       (pred_1 obj_20)
       (pred_1 obj_08)
       (pred_1 obj_25)
       (pred_1 obj_01)
       (pred_1 obj_13)
       (pred_1 obj_17)
       (pred_1 obj_19)
       (pred_1 obj_27)
       (pred_1 obj_21)
       (pred_1 obj_23)
       (pred_1 obj_06)
       (pred_1 obj_26)
       (pred_1 obj_10)
       (pred_2 obj_24)
       (pred_2 obj_31)
       (pred_2 obj_11)
       (pred_3 obj_30)
       (pred_3 obj_29)
       (pred_3 obj_15)

       (pred_7 obj_04 obj_03)
       (pred_7 obj_04 obj_14)
       (pred_7 obj_14 obj_18)
       (pred_7 obj_14 obj_09)
       (pred_7 obj_14 obj_04)
       (pred_7 obj_09 obj_16)
       (pred_7 obj_09 obj_07)
       (pred_7 obj_09 obj_14)
       (pred_7 obj_07 obj_05)
       (pred_7 obj_07 obj_28)
       (pred_7 obj_07 obj_09)
       (pred_7 obj_28 obj_22)
       (pred_7 obj_28 obj_07)
       (pred_7 obj_03 obj_02)
       (pred_7 obj_03 obj_18)
       (pred_7 obj_03 obj_04)
       (pred_7 obj_18 obj_12)
       (pred_7 obj_18 obj_16)
       (pred_7 obj_18 obj_14)
       (pred_7 obj_18 obj_03)
       (pred_7 obj_16 obj_20)
       (pred_7 obj_16 obj_05)
       (pred_7 obj_16 obj_09)
       (pred_7 obj_16 obj_18)
       (pred_7 obj_05 obj_08)
       (pred_7 obj_05 obj_22)
       (pred_7 obj_05 obj_07)
       (pred_7 obj_05 obj_16)
       (pred_7 obj_22 obj_25)
       (pred_7 obj_22 obj_28)
       (pred_7 obj_22 obj_05)
       (pred_7 obj_02 obj_01)
       (pred_7 obj_02 obj_12)
       (pred_7 obj_02 obj_03)
       (pred_7 obj_12 obj_13)
       (pred_7 obj_12 obj_20)
       (pred_7 obj_12 obj_18)
       (pred_7 obj_12 obj_02)
       (pred_7 obj_20 obj_17)
       (pred_7 obj_20 obj_08)
       (pred_7 obj_20 obj_16)
       (pred_7 obj_20 obj_12)
       (pred_7 obj_08 obj_19)
       (pred_7 obj_08 obj_25)
       (pred_7 obj_08 obj_05)
       (pred_7 obj_08 obj_20)
       (pred_7 obj_25 obj_27)
       (pred_7 obj_25 obj_22)
       (pred_7 obj_25 obj_08)
       (pred_7 obj_01 obj_21)
       (pred_7 obj_01 obj_13)
       (pred_7 obj_01 obj_02)
       (pred_7 obj_13 obj_23)
       (pred_7 obj_13 obj_17)
       (pred_7 obj_13 obj_12)
       (pred_7 obj_13 obj_01)
       (pred_7 obj_17 obj_06)
       (pred_7 obj_17 obj_19)
       (pred_7 obj_17 obj_20)
       (pred_7 obj_17 obj_13)
       (pred_7 obj_19 obj_26)
       (pred_7 obj_19 obj_27)
       (pred_7 obj_19 obj_08)
       (pred_7 obj_19 obj_17)
       (pred_7 obj_27 obj_10)
       (pred_7 obj_27 obj_25)
       (pred_7 obj_27 obj_19)
       (pred_7 obj_21 obj_23)
       (pred_7 obj_21 obj_01)
       (pred_7 obj_23 obj_06)
       (pred_7 obj_23 obj_13)
       (pred_7 obj_23 obj_21)
       (pred_7 obj_06 obj_26)
       (pred_7 obj_06 obj_17)
       (pred_7 obj_06 obj_23)
       (pred_7 obj_26 obj_10)
       (pred_7 obj_26 obj_19)
       (pred_7 obj_26 obj_06)
       (pred_7 obj_10 obj_27)
       (pred_7 obj_10 obj_26)
       (pred_12 obj_26)
       (pred_12 obj_10)
       (pred_12 obj_17)
       (pred_6  obj_26 obj_24)
       (pred_6  obj_10 obj_31)
       (pred_6  obj_17 obj_11)
       (pred_8 obj_04)
       (pred_8 obj_14)
       (pred_8 obj_09)
       (pred_8 obj_07)
       (pred_8 obj_28)
       (pred_8 obj_03)
       (pred_8 obj_18)
       (pred_8 obj_16)
       (pred_8 obj_05)
       (pred_8 obj_22)
       (pred_8 obj_02)
       (pred_8 obj_12)
       (pred_8 obj_20)
       (pred_8 obj_08)
       (pred_8 obj_25)
       (pred_8 obj_01)
       (pred_8 obj_13)
       (pred_8 obj_19)
       (pred_8 obj_27)
       (pred_8 obj_21)
       (pred_8 obj_23)
       (pred_8 obj_06)

       (pred_10  obj_30 obj_24)
       (pred_10  obj_29 obj_31)
       (pred_10  obj_15 obj_11)
       (pred_9 obj_30 obj_20)
       (pred_9 obj_29 obj_12)
       (pred_9 obj_15 obj_04)
       (pred_4 obj_28)
    )

    (:goal (and
       (pred_9 obj_29 obj_13)
    ))
(:constraints
  (always (not (pred_4 obj_18)))
)
)

; plan
1. (op_4 obj_28 obj_07)
   deleted: (pred_4 obj_28)
   added: (pred_4 obj_07)
   goals met: 0 of 1
2. (op_4 obj_07 obj_09)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_09)
   goals met: 0 of 1
3. (op_4 obj_09 obj_16)
   deleted: (pred_4 obj_09)
   added: (pred_4 obj_16)
   goals met: 0 of 1
4. (op_4 obj_16 obj_20)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_20)
   goals met: 0 of 1
5. (op_4 obj_20 obj_12)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_12)
   goals met: 0 of 1
6. (op_3 obj_12 obj_29)
   deleted: (pred_9 obj_29 obj_12) (pred_11)
   added: (pred_5 obj_29)
   goals met: 0 of 1
7. (op_4 obj_12 obj_13)
   deleted: (pred_4 obj_12)
   added: (pred_4 obj_13)
   goals met: 0 of 1
8. (op_2 obj_13 obj_29)
   deleted: (pred_5 obj_29)
   added: (pred_11) (pred_9 obj_29 obj_13)
   goals met: 1 of 1
